[
    {
        "company":"Slack",
        "title": "Incoming Software Engineering Intern",
        "period":"May 2020 - August 2020",
        "type":"industry",
        "summary": "TBD",
        "src":"",
        "link":""
    },
    {
        "company":"Williams Lab",
        "title": "Undergraduate Research Assistant",
        "period":"September 2018 - Present",
        "type":"research",
        "summary": "I am a research assistant for Professor Williams and Professor Sudmant, assisting them in their joint research project to find a molecular basis for convergence of dormancy. In other words, we are trying to show that all the different forms of hibernations, in both mammals and insects, have a genetic basic. So far, my partner and I have developed an algorithm that efficiently finds gene mapping, given a set of species and genes. Furthermore, we've developed a formatter that converts the output, into a structure that is readily used by many genetic analysis programs, including PAML.",
        "src":""
    },
    {
        "company":"U.C. Berkeley IEEE Branch",
        "title":"Web Committee Director",
        "period":"January 2018 - December 2020",
        "type":"project",
        "summary":"I lead the website committee of the Berkeley branch of IEEE. As a committee, we update and develop features for our organization's website.",
        "src":""
    },
    {
        "company":"Norton",
        "title": "Software Engineering Intern",
        "period":"May 2019 - August 2019",
        "type":"industry",
        "summary": "I built an automated performance testing pipeline on the Mobile Security Team that uses sampled data for analysis to provide easily interpretable statistics and alerts incase of performance differences between product releases.",
        "src":""
    },
    {
        "company":"CatalistX",
        "title": "Software Engineering Intern",
        "period":"November 2018 - February 2019",
        "type":"industry",
        "summary": "I work with the lead developer on creating features on our product, a website that establishes a connection between growing start ups and college students interested in working at start ups.",
        "src":""
    },
    {
        "company": "ULAB",
        "title": "Undergraduate Researcher",
        "period": "October 2017 - May 2018",
        "type": "research",
        "summary":"I conducted research on brain atrophy from chronic neurodegenerative diseases at the computational level. Cooperated with other student researchers to develop a model that corresponds to the brain atrophication process."
    }
]